# Create Series

In [2]:
import pandas as pd
series = pd.Series()
print(series)

Series([], dtype: object)

In [4]:
import numpy as np
arr1 = np.array([10,12,14,16,17,19,21])
series = pd.Series(arr1)
print(series)

0    10
1    12
2    14
3    16
4    17
5    19
6    21
dtype: int32

In [5]:
arr1 = np.array([10,20,30,40,50,60,70,80])
series = pd.Series(arr1)
print(series)
# Extracting the specific element
print(series[::-1])

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int32
7    80
6    70
5    60
4    50
3    40
2    30
1    20
0    10
dtype: int32

In [6]:
print(series[1:5])

1    20
2    30
3    40
4    50
dtype: int32

In [7]:
print(series[1:8:2])

1    20
3    40
5    60
7    80
dtype: int32

In [9]:
# I wnat to series from dictionary

dict1 = {'Q1':10,'Q2':20,'Q3':30,'Q4':40}
print(dict1)
series = pd.Series(dict1)
print(series)

{'Q1': 10, 'Q2': 20, 'Q3': 30, 'Q4': 40}
Q1    10
Q2    20
Q3    30
Q4    40
dtype: int64

In [13]:
print(series['Q2':'Q4'])

Q2    20
Q3    30
Q4    40
dtype: int64

In [14]:
print(series['Q3':'Q4'])

Q3    30
Q4    40
dtype: int64

In [15]:
print(series['Q1':'Q2'])

Q1    10
Q2    20
dtype: int64

# Update Values in the Series

In [24]:
dict1 = {'Q1':1,'Q2':2,'Q3':3,'Q4':4}
series=pd.Series(dict1)
print(series)
series[1] = 20
print('\n')
print(series)

Q1    1
Q2    2
Q3    3
Q4    4
dtype: int64


Q1     1
Q2    20
Q3     3
Q4     4
dtype: int64

C:\Users\pmgho\AppData\Local\Temp\ipykernel_13524\4098722450.py:4: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  series[1] = 20

In [26]:
dict1 = {'Q1':10,'Q2':20,'Q3':30,'Q4':50}
series = pd.Series(dict1)
print(series)
print('\n')
series[3] = 300
print(series)

Q1    10
Q2    20
Q3    30
Q4    50
dtype: int64


Q1     10
Q2     20
Q3     30
Q4    300
dtype: int64

C:\Users\pmgho\AppData\Local\Temp\ipykernel_13524\961164674.py:5: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  series[3] = 300

# Data Frames

In [28]:
# How to Series convert into DataFrame

import numpy as np
import pandas as pd
list1 = [10,20,30,40,50]
series = pd.Series(list1)
print(series)
print('\n')
print('####### Data Frame ########')
dataframe = pd.DataFrame(series)
display(dataframe)

0    10
1    20
2    30
3    40
4    50
dtype: int64


####### Data Frame ########

    0
0  10
1  20
2  30
3  40
4  50

# Dictionary List

In [31]:
list2  = [{'Name':'Prajwal','Last_name':'Ghotkar','Age':24},{'Name':'Sanorita','Last_name':'Ghotkar','Age':28},{'Name':'Jully','Last_name':'Kim','Age':25},{'Name':'Vassia','Last_name':'Ghotkar','Age':23}]
dataframe = pd.DataFrame(list2)
display(dataframe)

       Name Last_name  Age
0   Prajwal   Ghotkar   24
1  Sanorita   Ghotkar   28
2     Jully       Kim   25
3    Vassia   Ghotkar   23

# List with one dictionary

In [36]:
list2 = [{'Name':['Prajwal','Jully','Vissna','Sanorita','Alyen'],'Last_name':['Ghotkar','Thakur','Ghotkar','Maliya','Juliya'],'Location':['UK','USA','London','Brazil','Canada']}]
dataframe = pd.DataFrame(list2)
display(dataframe)

,Name,Last_name,Location
0,"[Prajwal, Jully, Vissna, Sanorita, Alyen]","[Ghotkar, Thakur, Ghotkar, Maliya, Juliya]","[UK, USA, London, Brazil, Canada]"

# Data Frame from list with NaN

In [38]:
list1 = [['Sam',90,8088],['Lilly','Tom',79,8887],['Jully',89,9877]]
print(list1)
print('####### Data Frame #######')
df1 = pd.DataFrame(list1)
print(df1)

[['Sam', 90, 8088], ['Lilly', 'Tom', 79, 8887], ['Jully', 89, 9877]]
####### Data Frame #######
       0    1     2       3
0    Sam   90  8088     NaN
1  Lilly  Tom    79  8887.0
2  Jully   89  9877     NaN

In [42]:
list1 = [['Prajwal',21,'Male','UK'],['Samu',24,'Female','UK'],['Seju',23,'Female','USA'],['Manu',26,'Feamle','USA']]
df2 = pd.DataFrame(list1,columns = ['Name','Age','Gender','Location'])
display(df2)

      Name  Age  Gender Location
0  Prajwal   21    Male       UK
1     Samu   24  Female       UK
2     Seju   23  Female      USA
3     Manu   26  Feamle      USA

In [44]:
list2 = [{'Name':'Prajwal','Age':24,'Location':'USA'},{'Name':'Samu','Age':23,'Location':'UK'},{'Name':'Manu','Age':25,'Location':'USA'}]
df = pd.DataFrame(list2)
display(df)

      Name  Age Location
0  Prajwal   24      USA
1     Samu   23       UK
2     Manu   25      USA

In [45]:
list2 = [{'Name':'Prajwal','Age':24,'Location':'USA'},{'Name':'Samu','Age':23},{'Name':'Manu','Age':25,'Location':'USA'}]
df = pd.DataFrame(list2)
display(df)

      Name  Age Location
0  Prajwal   24      USA
1     Samu   23      NaN
2     Manu   25      USA

# Row Index

In [47]:
list1 = [['Prajwal',21,'USA'],['Jully',23,'UK'],['Lilly',24,'USA']]
df = pd.DataFrame(list1,columns=['Name','Age','Location'],index = ['Row1','Row2','Row3'])
display(df)

         Name  Age Location
Row1  Prajwal   21      USA
Row2    Jully   23       UK
Row3    Lilly   24      USA

# Addition of new column to Data Frame[Column]

In [57]:
data1 = {'Name':pd.Series(['Prajwal','Jully','Lilly','Virsika'],index = ['a','b','c','d']),'Age':pd.Series([21,23,24,21],index=['a','b','c','d']),'Salary':pd.Series(['$98798789','$4354543','$234432','$24767823'],index = ['a','b','c','d'])}
dataframe1 = pd.DataFrame(data1)

In [58]:
# i'll add one more column in my dataframe

dataframe1['Location'] = pd.Series(['USA','Brazil','UK','London'], index=['a','b','c','d'])
display(dataframe)

,Name,Last_name,Location
0,"[Prajwal, Jully, Vissna, Sanorita, Alyen]","[Ghotkar, Thakur, Ghotkar, Maliya, Juliya]","[UK, USA, London, Brazil, Canada]"

In [61]:
import pandas as pd

data1 = {
    'Name': pd.Series(['Prajwal', 'Jully', 'Lilly', 'Virsika'], index=['a', 'b', 'c', 'd']),
    'Age': pd.Series([21, 23, 24, 21], index=['a', 'b', 'c', 'd']),
    'Salary': pd.Series(['$98798789', '$4354543', '$234432', '$24767823','$8797979'], index=['a', 'b', 'c', 'd','e'])
}

dataframe1 = pd.DataFrame(data1)

# Add new column
dataframe1['Location'] = pd.Series(['USA', 'Brazil', 'UK', 'London'], index=['a', 'b', 'c', 'd'])

# Display the DataFrame
display(dataframe1)

      Name   Age     Salary Location
a  Prajwal  21.0  $98798789      USA
b    Jully  23.0   $4354543   Brazil
c    Lilly  24.0    $234432       UK
d  Virsika  21.0  $24767823   London
e      NaN   NaN   $8797979      NaN

In [65]:
import pandas as pd

data1 = {
    'Name': pd.Series(['Prajwal', 'Jully', 'Lilly', 'Virsika'], index=['a', 'b', 'c', 'd']),
    'Age': pd.Series([21, 23, 24, 21], index=['a', 'b', 'c', 'd']),
    'Salary': pd.Series(['$98798789', '$4354543', '$234432', '$24767823'], index=['a', 'b', 'c', 'd'])
}

dataframe1 = pd.DataFrame(data1)

# Add new column
dataframe1['Location'] = pd.Series(['USA', 'Brazil', 'UK', 'London'] , index=['a', 'b', 'c', 'd'])

new_data = pd.Series(['Itally','Brazil'],index=['e','f'])

dataframe1['Location'] = pd.concat([dataframe1['Location'],new_data])
display(dataframe1)

      Name  Age     Salary Location
a  Prajwal   21  $98798789      USA
b    Jully   23   $4354543   Brazil
c    Lilly   24    $234432       UK
d  Virsika   21  $24767823   London

# Print one column

In [67]:
list2 = [['Prajwal','Ghotkar',21,'USA'],['Manasawi','Ghotkar',22,'UK'],['Samikshya','Dhule',23,'USA'],['Seju','Dhule',21,'USA']]
df = pd.DataFrame(list2,columns = ['Name','Last_name','Age','Location'],index = ['Row1','Row2','Row3','Row4'])
display(df)

           Name Last_name  Age Location
Row1    Prajwal   Ghotkar   21      USA
Row2   Manasawi   Ghotkar   22       UK
Row3  Samikshya     Dhule   23      USA
Row4       Seju     Dhule   21      USA

In [69]:
print(df['Location'])

Row1    USA
Row2     UK
Row3    USA
Row4    USA
Name: Location, dtype: object

In [70]:
print(df['Name'])

Row1      Prajwal
Row2     Manasawi
Row3    Samikshya
Row4         Seju
Name: Name, dtype: object

In [71]:
list2 = [['Prajwal','Ghotkar',21,'USA'],['Manasawi','Ghotkar',22,'UK'],['Samikshya','Dhule',23,'USA'],['Seju','Dhule',21,'USA']]
df = pd.DataFrame(list2,columns = ['Name','Last_name','Age','Location'],index = ['Row1','Row2','Row3','Row4'])
display(df)

           Name Last_name  Age Location
Row1    Prajwal   Ghotkar   21      USA
Row2   Manasawi   Ghotkar   22       UK
Row3  Samikshya     Dhule   23      USA
Row4       Seju     Dhule   21      USA

In [72]:
print(df.columns[1])

Last_name

In [73]:
print(df.columns[1:3])

Index(['Last_name', 'Age'], dtype='object')

In [75]:
print(df.columns[0])

Name

In [76]:
print(df.columns[1:])

Index(['Last_name', 'Age', 'Location'], dtype='object')